module.exports = Object.freeze({
	MAX_LENGTH: 30000,
	pageSize  : 30,
	teacher   : 1,
	student   : 2,
	user      : 3,
	gender    : {
		1: '男',
		2: '女'
	},
	grade     : [{
		id  : 30,
		name: '学前1年'
	}, {
		id  : 40,
		name: '一年级'
	}, {
		id  : 50,
		name: '二年级'
	}, {
		id  : 60,
		name: '三年级'
	}, {
		id  : 70,
		name: '四年级'
	}, {
		id  : 80,
		name: '五年级'
	}, {
		id  : 90,
		name: '六年级'
	}],
	term      : [{
		id   : 30,
		name : '学前1年秋季',
		grade: 30
	}, {
		id   : 31,
		name : '学前1年春季',
		grade: 30
	}, {
		id   : 40,
		name : '一年级秋季',
		grade: 40
	}, {
		id   : 41,
		name : '一年级寒假',
		grade: 40
	}, {
		id   : 42,
		name : '一年级春季',
		grade: 40
	}, {
		id   : 43,
		name : '一年级暑假',
		grade: 40
	}, {
		id   : 50,//42,
		name : '二年级秋季',
		grade: 50
	}, {
		id   : 51,
		name : '二年级寒假',
		grade: 50
	}, {
		id   : 52,//43,
		name : '二年级春季',
		grade: 50
	}, {
		id   : 53,
		name : '二年级暑假',
		grade: 50
	}, {
		id   : 60,//44,
		name : '三年级秋季',
		grade: 60
	}, {
		id   : 61,
		name : '三年级寒假',
		grade: 60
	}, {
		id   : 62,//45,
		name : '三年级春季',
		grade: 60
	}, {
		id   : 63,
		name : '三年级暑假',
		grade: 60
	}, {
		id   : 70,//46,
		name : '四年级秋季',
		grade: 70
	}, {
		id   : 71,
		name : '四年级寒假',
		grade: 70
	}, {
		id   : 72,//47,
		name : '四年级春季',
		grade: 70
	}, {
		id   : 73,
		name : '四年级暑假',
		grade: 70
	}, {
		id   : 80,//48,
		name : '五年级秋季',
		grade: 80
	}, {
		id   : 81,
		name : '五年级寒假',
		grade: 80
	}, {
		id   : 82,//49,
		name : '五年级春季',
		grade: 80
	}, {
		id   : 83,
		name : '五年级暑假',
		grade: 80
	}, {
		id   : 90,//50,
		name : '六年级秋季',
		grade: 90
	}, {
		id   : 91,
		name : '六年级寒假',
		grade: 90
	}, {
		id   : 92,//51,
		name : '六年级春季',
		grade: 90
	}, {
		id   : 93,
		name : '六年级暑假',
		grade: 90
	}, {
		id   : 10086,
		name : '入学测试',
		grade: 10086
	}],
	resource  : {
		powerpoint: {
			id  : 1,
			name: '课件'
		},
		video     : {
			id  : 2,
			name: '视频'
		},
		audio     : {
			id  : 3,
			name: '音频'
		},
		lockscreen: {
			id  : 4,
			name: '锁屏'
		},
		paper     : {
			id  : 5,
			name: '试卷'
		},
		book      : {
			id  : 6,
			name: '教材'
		}
	},
	// 解题策略
	algorithm : {
		1 : '分类',
		2 : '转化（化归）',
		3 : '三量关系',
		4 : '空间感',
		5 : '数感',
		6 : '找规律',
		7 : '几何直观',
		8 : '运算律',
		9 : '模型思想',
		10: '应用',
		11: '创新与发散',
		12: '列表',
		13: '对应',
		14: '尝试与猜测',
		15: '排除',
		16: '分段计算',
		17: '操作法',
		18: '分类讨论(汇总)',
		19: '找"1"',
		20: '抽象',
		21: '归纳',
		22: '演绎',
		23: '数形结合',
		24: '逆推',
		25: '概括公式',
		26: '数据统计分析',
		27: '从特例开始找规律',
		28: '假设',
		29: '等量代换',
		30: '推理',
		31: '凑"整"',
		32: '比较',
		33: '移多补少',
		34: '设数',
		35: '抓不变量',
		36: '平均数',
		37: '筛选',
		38: '拆分',
		39: '类比',
		40: '枚举（列举）',
		41: '等积变形',
		42: '找不同',
		43: '找相同',
		44: '抽屉原理',
		45: '容斥原理',
		46: '加法原理',
		47: '乘法原理',
		48: '图形变换',
		49: '加减消元',
		50: '比例'
	},
	zuoye     : 1,
	ceyan     : 2,
	cuoti     : 3,
	fuxi      : 4
});